* Prepare conformance metadata
#+begin_src shell
K8S_LATEST_VERSION=$(curl -L -s https://storage.googleapis.com/kubernetes-release/release/stable.txt)
K8S_LATEST_MINOR_VERSION=$(awk '{split($1,array, "."); print array[2]}' <<< $K8S_LATEST_VERSION)
SETS=($(seq 15 $K8S_LATEST_MINOR_VERSION) master)
rm -r ./kodata/conformance-testdata/
mkdir -p ./kodata/conformance-testdata/{v1.{15..24},master}/

MANIFESTS=(
  https://raw.githubusercontent.com/cncf-infra/prow-config/master/docs/conformance_v1.{15..17}.yaml
  https://raw.githubusercontent.com/cncf-infra/prow-config/master/tests/conformance-1.18.yaml
  https://raw.githubusercontent.com/kubernetes/kubernetes/release-1.{19..24}/test/conformance/testdata/conformance.yaml
  https://raw.githubusercontent.com/kubernetes/kubernetes/master/test/conformance/testdata/conformance.yaml
)

re="^.*([0-9].[0-9]{2}|master).*$"
for METADATA in ${MANIFESTS[*]}; do
    if [[ $METADATA =~ $re ]]; then
        version=${BASH_REMATCH[1]}

        semver="v${version}"
        if [ "${version}" = master ]; then
            semver="${version}"
        fi
        curl -L \
            -o ./kodata/conformance-testdata/${semver}/conformance.yaml \
            ${METADATA}
    fi
done
#+end_src

#+RESULTS:
#+begin_example
#+end_example

* Set up local dev
Log into GitHub regularly
#+begin_src tmate :window prow-config
unset GITHUB_TOKEN
gh auth login
#+end_src

Update the oauth secret
#+begin_src shell
kubectl -n prow create secret generic prow-github-oauth \
    --from-literal=oauth=$(yq e '."github.com".oauth_token' -P - < ~/.config/gh/hosts.yml) \
    --dry-run=client -o yaml \
    | kubectl apply -f -
#+end_src

#+RESULTS:
#+begin_example
secret/prow-github-oauth configured
#+end_example

Install the config
#+begin_src shell
kubectl -n prow create cm vcr-config --from-file=vcr.yaml=./vcr.yaml --dry-run=client -o yaml | \
    kubectl -n prow apply -f -
#+end_src

#+RESULTS:
#+begin_example
configmap/vcr-config created
#+end_example

Install the plugin
#+begin_src shell
kubectl -n prow apply -f verify-conformance-release-deployment-dev-temp.yaml
#+end_src

#+RESULTS:
#+begin_example
deployment.apps/verify-conformance-release created
#+end_example

Read the logs
#+begin_src tmate :window prow-config
kubectl -n prow logs -l app=verify-conformance-release --tail=50 -f
#+end_src

Restart it
#+begin_src tmate :window prow-config
kubectl -n prow rollout restart deployment verify-conformance-release
#+end_src

#+RESULTS:
#+begin_example
deployment.apps/verify-conformance-release restarted
#+end_example

Uninstall the plugin
#+begin_src shell
kubectl -n prow delete -f verify-conformance-release-deployment-dev-temp.yaml
#+end_src

#+RESULTS:
#+begin_example
deployment.apps "verify-conformance-release" deleted
#+end_example

